In [ ]:
# Data Cleaning
# You should follow the order provided below:
    # Completeness issues
    # Tidiness Issues
    # Remaining Data quality issues like validy, accuracy and consistancy
# Steps involved data cleaning
    # Define
    # Code
    # Test

In [1]:
# Import required libraries
import pandas as pd

In [69]:
# Import dataset
patients=pd.read_csv('patients.csv')
treatment=pd.read_csv('treatments.csv')
adverse=pd.read_csv('adverse_reactions.csv')

In [36]:
patients

,patient_id,assigned_sex,given_name,surname,address,city,state,zip_code,country,contact,birthdate,weight,height,bmi
0,1,female,Zoe,Wellish,576 Brown Bear Drive,Rancho California,California,92390.0,United States,951-719-9170ZoeWellish@superrito.com,7/10/1976,121.7,66,19.6
1,2,female,Pamela,Hill,2370 University Hill Road,Armstrong,Illinois,61812.0,United States,PamelaSHill@cuvox.de+1 (217) 569-3204,4/3/1967,118.8,66,19.2
2,3,male,Jae,Debord,1493 Poling Farm Road,York,Nebraska,68467.0,United States,402-363-6804JaeMDebord@gustr.com,2/19/1980,177.8,71,24.8
3,4,male,Liêm,Phan,2335 Webster Street,Woodbridge,NJ,7095.0,United States,PhanBaLiem@jourrapide.com+1 (732) 636-8246,7/26/1951,220.9,70,31.7
4,5,male,Tim,Neudorf,1428 Turkey Pen Lane,Dothan,AL,36303.0,United States,334-515-7487TimNeudorf@cuvox.de,2/18/1928,192.3,27,26.1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
498,499,male,Mustafa,Lindström,2530 Victoria Court,Milton Mills,ME,3852.0,United States,207-477-0579MustafaLindstrom@jourrapide.com,4/10/1959,181.1,72,24.6
499,500,male,Ruman,Bisliev,494 Clarksburg Park Road,Sedona,AZ,86341.0,United States,928-284-4492RumanBisliev@gustr.com,3/26/1948,239.6,70,34.4
500,501,female,Jinke,de Keizer,649 Nutter Street,Overland Park,MO,64110.0,United States,816-223-6007JinkedeKeizer@teleworm.us,1/13/1971,171.2,67,26.8
501,502,female,Chidalu,Onyekaozulu,3652 Boone Crockett Lane,Seattle,WA,98109.0,United States,ChidaluOnyekaozulu@jourrapide.com1 360 443 2060,2/13/1952,176.9,67,27.7
502,503,male,Pat,Gersten,2778 North Avenue,Burr,Nebraska,68324.0,United States,PatrickGersten@rhyta.com402-848-4923,5/3/1954,138.2,71,19.3

In [70]:
treatment

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,veronika,jindrová,41u - 48u,-,7.63,7.20,NaN
1,elliot,richardson,-,40u - 45u,7.56,7.09,0.97
2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,NaN
3,skye,gormanston,33u - 36u,-,7.97,7.62,0.35
4,alissa,montez,-,33u - 29u,7.78,7.46,0.32
...,...,...,...,...,...,...,...
275,albina,zetticci,45u - 51u,-,7.93,7.73,0.20
276,john,teichelmann,-,49u - 49u,7.90,7.58,NaN
277,mathea,lillebø,23u - 36u,-,9.04,8.67,0.37
278,vallie,prince,31u - 38u,-,7.64,7.28,0.36
279,samúel,guðbrandsson,53u - 56u,-,8.00,7.64,0.36

In [71]:
# Copy dataset
patients_copy=patients.copy()
treatment_copy=treatment.copy()
adverse_copy=adverse.copy

In [39]:
# Completeness issues
    # Missing values for contact details of 12 patients
    # Only 280 rows are there instead of 350
    # hba1_c change col has missing values

In [40]:
# Define
    # Substract hba1c_Start from hba1c_end to get hba1c_change

In [72]:
# Code
treatment_copy['hba1c_change']=treatment_copy['hba1c_start']-treatment_copy['hba1c_end']

In [73]:
# Test
treatment_copy['hba1c_change'].isnull().sum()

np.int64(0)

In [74]:
# Check basic information
treatment_copy

,given_name,surname,auralin,novodra,hba1c_start,hba1c_end,hba1c_change
0,veronika,jindrová,41u - 48u,-,7.63,7.20,0.43
1,elliot,richardson,-,40u - 45u,7.56,7.09,0.47
2,yukitaka,takenaka,-,39u - 36u,7.68,7.25,0.43
3,skye,gormanston,33u - 36u,-,7.97,7.62,0.35
4,alissa,montez,-,33u - 29u,7.78,7.46,0.32
...,...,...,...,...,...,...,...
275,albina,zetticci,45u - 51u,-,7.93,7.73,0.20
276,john,teichelmann,-,49u - 49u,7.90,7.58,0.32
277,mathea,lillebø,23u - 36u,-,9.04,8.67,0.37
278,vallie,prince,31u - 38u,-,7.64,7.28,0.36
279,samúel,guðbrandsson,53u - 56u,-,8.00,7.64,0.36

In [44]:
# Tidiness Issues
    # Phone +email in contact col patients
    # Merge the adverse table to treatment table
    # Novodra and aurolin col treatment

In [45]:
# Define
# create different column from aurolin and novodra

In [75]:
# Code
treatment_copy=pd.melt(treatment_copy, id_vars=['given_name', 'surname', 'hba1c_start', 'hba1c_end'],
                       var_name='treatment', value_name='dose')

In [76]:
treatment_copy

    given_name       surname  hba1c_start  hba1c_end     treatment       dose
0     veronika      jindrová         7.63       7.20       auralin  41u - 48u
1       elliot    richardson         7.56       7.09       auralin          -
2     yukitaka      takenaka         7.68       7.25       auralin          -
3         skye    gormanston         7.97       7.62       auralin  33u - 36u
4       alissa        montez         7.78       7.46       auralin          -
..         ...           ...          ...        ...           ...        ...
835     albina      zetticci         7.93       7.73  hba1c_change        0.2
836       john   teichelmann         7.90       7.58  hba1c_change       0.32
837     mathea       lillebø         9.04       8.67  hba1c_change       0.37
838     vallie        prince         7.64       7.28  hba1c_change       0.36
839     samúel  guðbrandsson         8.00       7.64  hba1c_change       0.36

[840 rows x 6 columns]

In [81]:
# Remove [-] from dose column
treatment_copy=treatment_copy[treatment_copy['dose']!='-']
treatment_copy

    given_name       surname  hba1c_start  hba1c_end     treatment       dose
0     veronika      jindrová         7.63       7.20       auralin  41u - 48u
3         skye    gormanston         7.97       7.62       auralin  33u - 36u
6       sophia        haugen         7.65       7.27       auralin  37u - 42u
7        eddie        archer         7.89       7.55       auralin  31u - 38u
9         asia       woźniak         7.76       7.37       auralin  30u - 36u
..         ...           ...          ...        ...           ...        ...
835     albina      zetticci         7.93       7.73  hba1c_change        0.2
836       john   teichelmann         7.90       7.58  hba1c_change       0.32
837     mathea       lillebø         9.04       8.67  hba1c_change       0.37
838     vallie        prince         7.64       7.28  hba1c_change       0.36
839     samúel  guðbrandsson         8.00       7.64  hba1c_change       0.36

[560 rows x 6 columns]

In [82]:
# Convert dose column into two column
treatment_copy[['start', 'end']] = (
    treatment_copy['dose']
    .astype(str)
    .str.split('-', n=1, expand=True)
)

In [83]:
treatment_copy

,given_name,surname,hba1c_start,hba1c_end,treatment,dose,start,end
0,veronika,jindrová,7.63,7.20,auralin,41u - 48u,41u,48u
3,skye,gormanston,7.97,7.62,auralin,33u - 36u,33u,36u
6,sophia,haugen,7.65,7.27,auralin,37u - 42u,37u,42u
7,eddie,archer,7.89,7.55,auralin,31u - 38u,31u,38u
9,asia,woźniak,7.76,7.37,auralin,30u - 36u,30u,36u
...,...,...,...,...,...,...,...,...
835,albina,zetticci,7.93,7.73,hba1c_change,0.2,0.1999999999999993,None
836,john,teichelmann,7.90,7.58,hba1c_change,0.32,0.3200000000000003,None
837,mathea,lillebø,9.04,8.67,hba1c_change,0.37,0.3699999999999992,None
838,vallie,prince,7.64,7.28,hba1c_change,0.36,0.35999999999999943,None
839,samúel,guðbrandsson,8.00,7.64,hba1c_change,0.36,0.3600000000000003,None

In [85]:
# Drop dose column
treatment_copy.drop(columns='dose', inplace=True)

In [86]:
#Test
treatment_copy.head(10)

   given_name       surname  hba1c_start  hba1c_end treatment start   end
0    veronika      jindrová         7.63       7.20   auralin  41u    48u
3        skye    gormanston         7.97       7.62   auralin  33u    36u
6      sophia        haugen         7.65       7.27   auralin  37u    42u
7       eddie        archer         7.89       7.55   auralin  31u    38u
9        asia       woźniak         7.76       7.37   auralin  30u    36u
10     joseph           day         7.70       7.19   auralin  29u    36u
12    roxanne     andreyeva         9.54       9.14   auralin  29u    38u
14     simone  baumgaertner         7.74       7.30   auralin  27u    37u
15       enco        žibrik         7.78       7.34   auralin  55u    68u
16    camilla      zaitseva         7.53       7.13   auralin  28u    37u